---
kind: type
id: T:Autodesk.Revit.DB.FormatStatus
source: html/81333f80-2181-8faa-9c1e-cadcda7f3b5e.htm
---
# Autodesk.Revit.DB.FormatStatus

An enumerated type indicating the formatting status of a range of characters
 in FormattedText

## Syntax (C#)
```csharp
public enum FormatStatus
```

## Remarks
The character formatting includes
 Bold Italic Underline SuperScript Subscript All Caps